import { markerBKK } from './markerBKK'

const correct = markerBKK.map(a => a.ใส่หน้ากาก ).reduce((a,b) => a+b ,0)
const in_correct = markerBKK.map(a => a.ใส่ไม่ถูกต้อง).reduce((a,b) => a+b ,0)
const no_mask = markerBKK.map(a =>a.ไม่ใส่หน้ากาก ).reduce((a,b) => a+b ,0)
const total = correct + in_correct + no_mask
const brief = (float: number) => {
  return Math.floor( float * 1000)/10
}
const camera_lists = markerBKK.map(mark => mark['เขต'])
const district_lists = [...new Set(camera_lists)]
const sort = district_lists.map(district => {
  const filter = markerBKK.filter(marker => marker['เขต'] == district).map(marker => {
    return marker['ใส่หน้ากาก'] / (marker['ใส่หน้ากาก'] + marker['ใส่ไม่ถูกต้อง'] + marker['ไม่ใส่หน้ากาก'])
  })
  const average = filter.reduce((a,b) => a + b, 0) / filter.length
  return {
    district,
    value: Math.floor( average * 1000)/10
  }
})
// console.log(sort)
export const data ={
  report_period: '7 - 17 มีค. 2564',
  previous_period: '20 กพ. - 4 มีค. 2564',
  result: {
    total,
    correct_percent: brief( correct/total ),
    in_correct_percent: brief( in_correct/total ),
    no_mask_percent: brief( no_mask/total ),
    district: district_lists.length,
    camera: camera_lists.length
  },
  sort_district:{
    red:  sort.filter(district => district.value <= 90).map(row => row.district),
    yellow: sort.filter(district => district.value <= 95 && district.value > 90).map(row => row.district)
  }
}

export const district = [
  {
    "เขต": "ยานนาวา",
    "ใส่หน้ากาก": "397",
    "ใส่ไม่ถูกต้อง": 51,
    "ไม่ใส่หน้ากาก": 69,
    "จำนวนประชากร": "517",
    "ร้อยละใส่": 76.79,
    "error": 23.21
  },
  {
    "เขต": "คลองสาน",
    "ใส่หน้ากาก": "2,073",
    "ใส่ไม่ถูกต้อง": 116,
    "ไม่ใส่หน้ากาก": 167,
    "จำนวนประชากร": "2,356",
    "ร้อยละใส่": 87.99,
    "error": 12.01
  },
  {
    "เขต": "บางคอแหลม",
    "ใส่หน้ากาก": "792",
    "ใส่ไม่ถูกต้อง": 64,
    "ไม่ใส่หน้ากาก": 48,
    "จำนวนประชากร": "904",
    "ร้อยละใส่": 87.61,
    "error": 12.39
  },
  {
    "เขต": "สาทร",
    "ใส่หน้ากาก": "1,643",
    "ใส่ไม่ถูกต้อง": 93,
    "ไม่ใส่หน้ากาก": 125,
    "จำนวนประชากร": "1,861",
    "ร้อยละใส่": 88.29,
    "error": 11.71
  },
  {
    "เขต": "ดอนเมือง",
    "ใส่หน้ากาก": "3,121",
    "ใส่ไม่ถูกต้อง": 129,
    "ไม่ใส่หน้ากาก": 211,
    "จำนวนประชากร": "3,461",
    "ร้อยละใส่": 90.18,
    "error": 9.82
  },
  {
    "เขต": "จอมทอง",
    "ใส่หน้ากาก": "3,000",
    "ใส่ไม่ถูกต้อง": 236,
    "ไม่ใส่หน้ากาก": 112,
    "จำนวนประชากร": "3,348",
    "ร้อยละใส่": 89.61,
    "error": 10.39
  },
  {
    "เขต": "บางรัก ",
    "ใส่หน้ากาก": "1,382",
    "ใส่ไม่ถูกต้อง": 66,
    "ไม่ใส่หน้ากาก": 50,
    "จำนวนประชากร": "1,498",
    "ร้อยละใส่": 92.26,
    "error": 7.74
  },
  {
    "เขต": "ป้อมปราบศัตรูพ่าย",
    "ใส่หน้ากาก": "1,194",
    "ใส่ไม่ถูกต้อง": 46,
    "ไม่ใส่หน้ากาก": 69,
    "จำนวนประชากร": "1,309",
    "ร้อยละใส่": 91.21,
    "error": 8.79
  },
  {
    "เขต": "สัมพันธวงศ์",
    "ใส่หน้ากาก": "2,405",
    "ใส่ไม่ถูกต้อง": 137,
    "ไม่ใส่หน้ากาก": 125,
    "จำนวนประชากร": "2,667",
    "ร้อยละใส่": 90.18,
    "error": 9.82
  },
  {
    "เขต": "บางกอกใหญ่",
    "ใส่หน้ากาก": "1,506",
    "ใส่ไม่ถูกต้อง": 49,
    "ไม่ใส่หน้ากาก": 80,
    "จำนวนประชากร": "1,635",
    "ร้อยละใส่": 92.11,
    "error": 7.89
  },
  {
    "เขต": "ภาษีเจริญ",
    "ใส่หน้ากาก": "2,700",
    "ใส่ไม่ถูกต้อง": 76,
    "ไม่ใส่หน้ากาก": 97,
    "จำนวนประชากร": "2,873",
    "ร้อยละใส่": 93.98,
    "error": 6.02
  },
  {
    "เขต": "บางกะปิ",
    "ใส่หน้ากาก": "3,444",
    "ใส่ไม่ถูกต้อง": 135,
    "ไม่ใส่หน้ากาก": 137,
    "จำนวนประชากร": "3,716",
    "ร้อยละใส่": 92.68,
    "error": 7.32
  },
  {
    "เขต": "ลาดกระบัง",
    "ใส่หน้ากาก": "978",
    "ใส่ไม่ถูกต้อง": 39,
    "ไม่ใส่หน้ากาก": 46,
    "จำนวนประชากร": "1,063",
    "ร้อยละใส่": 92,
    "error": 8
  },
  {
    "เขต": "สวนหลวง",
    "ใส่หน้ากาก": "2,646",
    "ใส่ไม่ถูกต้อง": 160,
    "ไม่ใส่หน้ากาก": 84,
    "จำนวนประชากร": "2,890",
    "ร้อยละใส่": 91.56,
    "error": 8.44
  },
  {
    "เขต": "ดุสิต",
    "ใส่หน้ากาก": "2,115",
    "ใส่ไม่ถูกต้อง": 60,
    "ไม่ใส่หน้ากาก": 89,
    "จำนวนประชากร": "2,264",
    "ร้อยละใส่": 93.42,
    "error": 6.58
  },
  {
    "เขต": "บางพลัด",
    "ใส่หน้ากาก": "4,632",
    "ใส่ไม่ถูกต้อง": 161,
    "ไม่ใส่หน้ากาก": 124,
    "จำนวนประชากร": "4,917",
    "ร้อยละใส่": 94.2,
    "error": 5.8
  },
  {
    "เขต": "พระนคร",
    "ใส่หน้ากาก": "2,062",
    "ใส่ไม่ถูกต้อง": 119,
    "ไม่ใส่หน้ากาก": 67,
    "จำนวนประชากร": "2,248",
    "ร้อยละใส่": 91.73,
    "error": 8.27
  },
  {
    "เขต": "บางกอกน้อย",
    "ใส่หน้ากาก": "2,947",
    "ใส่ไม่ถูกต้อง": 131,
    "ไม่ใส่หน้ากาก": 57,
    "จำนวนประชากร": "3,135",
    "ร้อยละใส่": 94,
    "error": 6
  },
  {
    "เขต": "ราษฎร์บูรณะ",
    "ใส่หน้ากาก": "2,827",
    "ใส่ไม่ถูกต้อง": 86,
    "ไม่ใส่หน้ากาก": 74,
    "จำนวนประชากร": "2,987",
    "ร้อยละใส่": 94.64,
    "error": 5.36
  },
  {
    "เขต": "ปทุมวัน",
    "ใส่หน้ากาก": "5,969",
    "ใส่ไม่ถูกต้อง": 181,
    "ไม่ใส่หน้ากาก": 82,
    "จำนวนประชากร": "6,232",
    "ร้อยละใส่": 95.78,
    "error": 4.22
  },
  {
    "เขต": "หนองแขม",
    "ใส่หน้ากาก": "2,397",
    "ใส่ไม่ถูกต้อง": 88,
    "ไม่ใส่หน้ากาก": 76,
    "จำนวนประชากร": "2,561",
    "ร้อยละใส่": 93.6,
    "error": 6.4
  },
  {
    "เขต": "บางขุนเทียน",
    "ใส่หน้ากาก": "1,844",
    "ใส่ไม่ถูกต้อง": 38,
    "ไม่ใส่หน้ากาก": 39,
    "จำนวนประชากร": "1,921",
    "ร้อยละใส่": 95.99,
    "error": 4.01
  },
  {
    "เขต": "บางเขน",
    "ใส่หน้ากาก": "1,646",
    "ใส่ไม่ถูกต้อง": 40,
    "ไม่ใส่หน้ากาก": 31,
    "จำนวนประชากร": "1,717",
    "ร้อยละใส่": 95.86,
    "error": 4.14
  },
  {
    "เขต": "บางนา",
    "ใส่หน้ากาก": "12,008",
    "ใส่ไม่ถูกต้อง": 337,
    "ไม่ใส่หน้ากาก": 152,
    "จำนวนประชากร": "12,497",
    "ร้อยละใส่": 96.09,
    "error": 3.91
  },
  {
    "เขต": "ราชเทวี",
    "ใส่หน้ากาก": "2,226",
    "ใส่ไม่ถูกต้อง": 74,
    "ไม่ใส่หน้ากาก": 37,
    "จำนวนประชากร": "2,337",
    "ร้อยละใส่": 95.25,
    "error": 4.75
  },
  {
    "เขต": "ทุ่งครุ",
    "ใส่หน้ากาก": "4,759",
    "ใส่ไม่ถูกต้อง": 127,
    "ไม่ใส่หน้ากาก": 55,
    "จำนวนประชากร": "4,941",
    "ร้อยละใส่": 96.32,
    "error": 3.68
  },
  {
    "เขต": "พญาไท",
    "ใส่หน้ากาก": "1,647",
    "ใส่ไม่ถูกต้อง": 22,
    "ไม่ใส่หน้ากาก": 16,
    "จำนวนประชากร": "1,685",
    "ร้อยละใส่": 97.74,
    "error": 2.26
  },
  {
    "เขต": "บางแค",
    "ใส่หน้ากาก": "4,280",
    "ใส่ไม่ถูกต้อง": 70,
    "ไม่ใส่หน้ากาก": 46,
    "จำนวนประชากร": "4,396",
    "ร้อยละใส่": 97.36,
    "error": 2.64
  },
  {
    "เขต": "คลองเตย",
    "ใส่หน้ากาก": "4,630",
    "ใส่ไม่ถูกต้อง": 69,
    "ไม่ใส่หน้ากาก": 33,
    "จำนวนประชากร": "4,732",
    "ร้อยละใส่": 97.84,
    "error": 2.16
  }
 ]


export const dayNightData = [
  {
    "วันที่": "21/01/2564",
    "unix": 242543,
    "weekday": 6,
    "วัน": "21/1",
    "เช้า": 1.93,
    "เย็น": 4.86,
    "รวม": 3.42
  },
  {
    "วันที่": "22/01/2564",
    "unix": 242544,
    "weekday": 7,
    "วัน": "22/1",
    "เช้า": 1.88,
    "เย็น": 3.47,
    "รวม": 2.71
  },
  {
    "วันที่": "23/01/2564",
    "unix": 242545,
    "weekday": 1,
    "วัน": "23/1",
    "เช้า": 2.68,
    "เย็น": 2.88,
    "รวม": 2.8
  },
  {
    "วันที่": "24/01/2564",
    "unix": 242546,
    "weekday": 2,
    "วัน": "24/1",
    "เช้า": 3.15,
    "เย็น": 3.47,
    "รวม": 3.34
  },
  {
    "วันที่": "25/01/2564",
    "unix": 242547,
    "weekday": 3,
    "วัน": "25/1",
    "เช้า": 1.29,
    "เย็น": 1.84,
    "รวม": 1.59
  },
  {
    "วันที่": "26/01/2564",
    "unix": 242548,
    "weekday": 4,
    "วัน": "26/1",
    "เช้า": 1.46,
    "เย็น": 1.46,
    "รวม": 1.46
  },
  {
    "วันที่": "27/01/2564",
    "unix": 242549,
    "weekday": 5,
    "วัน": "27/1",
    "เช้า": 1.98,
    "เย็น": 1.39,
    "รวม": 1.65
  },
  {
    "วันที่": "28/01/2564",
    "unix": 242550,
    "weekday": 6,
    "วัน": "28/1",
    "เช้า": 1.55,
    "เย็น": 1.35,
    "รวม": 1.44
  },
  {
    "วันที่": "29/01/2564",
    "unix": 242551,
    "weekday": 7,
    "วัน": "29/1",
    "เช้า": 1.99,
    "เย็น": 1.98,
    "รวม": 1.99
  },
  {
    "วันที่": "30/01/2564",
    "unix": 242552,
    "weekday": 1,
    "วัน": "30/1",
    "เช้า": 1.58,
    "เย็น": 1.54,
    "รวม": 1.55
  },
  {
    "วันที่": "31/01/2564",
    "unix": 242553,
    "weekday": 2,
    "วัน": "31/1",
    "เช้า": 3.06,
    "เย็น": 3.1,
    "รวม": 3.08
  },
  {
    "วันที่": "01/02/2564",
    "unix": 242554,
    "weekday": 3,
    "วัน": "1/2",
    "เช้า": 1.6,
    "เย็น": 2.09,
    "รวม": 1.85
  },
  {
    "วันที่": "02/02/2564",
    "unix": 242555,
    "weekday": 4,
    "วัน": "2/2",
    "เช้า": 1.35,
    "เย็น": 2.09,
    "รวม": 1.77
  },
  {
    "วันที่": "03/02/2564",
    "unix": 242556,
    "weekday": 5,
    "วัน": "3/2",
    "เช้า": 1.71,
    "เย็น": 2.83,
    "รวม": 2.25
  },
  {
    "วันที่": "04/02/2564",
    "unix": 242557,
    "weekday": 6,
    "วัน": "4/2",
    "เช้า": 1.8,
    "เย็น": 1.91,
    "รวม": 1.86
  },
  {
    "วันที่": "05/02/2564",
    "unix": 242558,
    "weekday": 7,
    "วัน": "5/2",
    "เช้า": 1.61,
    "เย็น": 2.04,
    "รวม": 1.84
  },
  {
    "วันที่": "06/02/2564",
    "unix": 242559,
    "weekday": 1,
    "วัน": "6/2",
    "เช้า": 1.76,
    "เย็น": 2.34,
    "รวม": 2.09
  },
  {
    "วันที่": "07/02/2564",
    "unix": 242560,
    "weekday": 2,
    "วัน": "7/2",
    "เช้า": 5.12,
    "เย็น": 3.4,
    "รวม": 4
  },
  {
    "วันที่": "08/02/2564",
    "unix": 242561,
    "weekday": 3,
    "วัน": "8/2",
    "เช้า": 1.38,
    "เย็น": 1.89,
    "รวม": 1.65
  },
  {
    "วันที่": "09/02/2564",
    "unix": 242562,
    "weekday": 4,
    "วัน": "9/2",
    "เช้า": 1.97,
    "เย็น": 2.46,
    "รวม": 2.23
  },
  {
    "วันที่": "10/02/2564",
    "unix": 242563,
    "weekday": 5,
    "วัน": "10/2",
    "เช้า": 2.23,
    "เย็น": 2.3,
    "รวม": 2.26
  },
  {
    "วันที่": "11/02/2564",
    "unix": 242564,
    "weekday": 6,
    "วัน": "11/2",
    "เช้า": 2.38,
    "เย็น": 3.27,
    "รวม": 2.82
  },
  {
    "วันที่": "12/02/2564",
    "unix": 242565,
    "weekday": 7,
    "วัน": "12/2",
    "เช้า": 2.11,
    "เย็น": 3.51,
    "รวม": 2.88
  },
  {
    "วันที่": "13/02/2564",
    "unix": 242566,
    "weekday": 1,
    "วัน": "13/2",
    "เช้า": 4.6,
    "เย็น": 4.46,
    "รวม": 4.51
  },
  {
    "วันที่": "14/02/2564",
    "unix": 242567,
    "weekday": 2,
    "วัน": "14/2",
    "เช้า": 5.3,
    "เย็น": 4.4,
    "รวม": 4.67
  },
  {
    "วันที่": "15/02/2564",
    "unix": 242568,
    "weekday": 3,
    "วัน": "15/2",
    "เช้า": 2.65,
    "เย็น": 3.31,
    "รวม": 3
  },
  {
    "วันที่": "16/02/2564",
    "unix": 242569,
    "weekday": 4,
    "วัน": "16/2",
    "เช้า": 2.64,
    "เย็น": 3.18,
    "รวม": 2.94
  },
  {
    "วันที่": "17/02/2564",
    "unix": 242570,
    "weekday": 5,
    "วัน": "17/2",
    "เช้า": 3.15,
    "เย็น": 3.75,
    "รวม": 3.5
  },
  {
    "วันที่": "18/02/2564",
    "unix": 242571,
    "weekday": 6,
    "วัน": "18/2",
    "เช้า": 3.21,
    "เย็น": 4.29,
    "รวม": 3.83
  },
  {
    "วันที่": "19/02/2564",
    "unix": 242572,
    "weekday": 7,
    "วัน": "19/2",
    "เช้า": 2.27,
    "เย็น": 3.76,
    "รวม": 3.71
  },
  {
    "วันที่": "20/02/2564",
    "unix": 242573,
    "weekday": 1,
    "วัน": "20/2",
    "เช้า": 4.43,
    "เย็น": 4.54,
    "รวม": 4.5
  },
  {
    "วันที่": "21/02/2564",
    "unix": 242574,
    "weekday": 2,
    "วัน": "21/2",
    "เช้า": 5.53,
    "เย็น": 6.37,
    "รวม": 6.04
  },
  {
    "วันที่": "22/02/2564",
    "unix": 242575,
    "weekday": 3,
    "วัน": "22/2",
    "เช้า": 3.19,
    "เย็น": 3.35,
    "รวม": 3.28
  },
  {
    "วันที่": "23/02/2564",
    "unix": 242576,
    "weekday": 4,
    "วัน": "23/2",
    "เช้า": 2.18,
    "เย็น": 2.84,
    "รวม": 2.54
  },
  {
    "วันที่": "24/02/2564",
    "unix": 242577,
    "weekday": 5,
    "วัน": "24/2",
    "เช้า": 2.79,
    "เย็น": 3.26,
    "รวม": 3.06
  },
  {
    "วันที่": "25/02/2564",
    "unix": 242578,
    "weekday": 6,
    "วัน": "25/2",
    "เช้า": 3.11,
    "เย็น": 3.91,
    "รวม": 3.54
  },
  {
    "วันที่": "26/02/2564",
    "unix": 242579,
    "weekday": 7,
    "วัน": "26/2",
    "เช้า": 3.79,
    "เย็น": 4.14,
    "รวม": 3.97
  },
  {
    "วันที่": "27/02/2564",
    "unix": 242580,
    "weekday": 1,
    "วัน": "27/2",
    "เช้า": 5.49,
    "เย็น": 5.83,
    "รวม": 5.69
  },
  {
    "วันที่": "28/02/2564",
    "unix": 242581,
    "weekday": 2,
    "วัน": "28/2",
    "เช้า": 6.74,
    "เย็น": 5.93,
    "รวม": 6.2
  },
  {
    "วันที่": "1/3/2564",
    "unix": 242583,
    "weekday": 4,
    "วัน": "1/3",
    "เช้า": 3.21,
    "เย็น": 4.16,
    "รวม": 3.74
  },
  {
    "วันที่": "2/3/2564",
    "unix": 242584,
    "weekday": 5,
    "วัน": "2/3",
    "เช้า": 3.24,
    "เย็น": 3.85,
    "รวม": 3.57
  },
  {
    "วันที่": "3/3/2564",
    "unix": 242585,
    "weekday": 6,
    "วัน": "3/3",
    "เช้า": 3.66,
    "เย็น": 3.96,
    "รวม": 3.83
  },
  {
    "วันที่": "4/3/2564",
    "unix": 242586,
    "weekday": 7,
    "วัน": "4/3",
    "เช้า": 4.17,
    "เย็น": 4.41,
    "รวม": 4.3
  },
  {
    "วันที่": "5/3/2564",
    "unix": 242587,
    "weekday": 1,
    "วัน": "5/3",
    "เช้า": 4.08,
    "เย็น": 5.46,
    "รวม": 4.76
  },
  {
    "วันที่": "6/3/2564",
    "unix": 242588,
    "weekday": 2,
    "วัน": "6/3",
    "เช้า": 5.18,
    "เย็น": 5.76,
    "รวม": 5.5
  },
  {
    "วันที่": "7/3/2564",
    "unix": 242589,
    "weekday": 3,
    "วัน": "7/3",
    "เช้า": 6.86,
    "เย็น": 6.54,
    "รวม": 6.67
  },
  {
    "วันที่": "8/3/2564",
    "unix": 242590,
    "weekday": 4,
    "วัน": "8/3",
    "เช้า": 4.85,
    "เย็น": 6.48,
    "รวม": 5.64
  },
  {
    "วันที่": "9/3/2564",
    "unix": 242591,
    "weekday": 5,
    "วัน": "9/3",
    "เช้า": 4.68,
    "เย็น": 6.28,
    "รวม": 5.51
  },
  {
    "วันที่": "10/3/2564",
    "unix": 242592,
    "weekday": 6,
    "วัน": "10/3",
    "เช้า": 4.56,
    "เย็น": 5.75,
    "รวม": 5.09
  },
  {
    "วันที่": "11/3/2564",
    "unix": 242593,
    "weekday": 7,
    "วัน": "11/3",
    "เช้า": 5.27,
    "เย็น": 6.73,
    "รวม": 6.04
  },
  {
    "วันที่": "12/3/2564",
    "unix": 242594,
    "weekday": 1,
    "วัน": "12/3",
    "เช้า": 4.7,
    "เย็น": 6.35,
    "รวม": 5.58
  },
  {
    "วันที่": "13/3/2564",
    "unix": 242595,
    "weekday": 2,
    "วัน": "13/3",
    "เช้า": 5.82,
    "เย็น": 6.92,
    "รวม": 6.45
  },
  {
    "วันที่": "14/3/2564",
    "unix": 242596,
    "weekday": 3,
    "วัน": "14/3",
    "เช้า": 9.38,
    "เย็น": 9.38,
    "รวม": 9.38
  },
  {
    "วันที่": "15/3/2564",
    "unix": 242597,
    "weekday": 4,
    "วัน": "15/3",
    "เช้า": 3.99,
    "เย็น": 3.99,
    "รวม": 3.99
  },
  {
    "วันที่": "16/3/2564",
    "unix": 242598,
    "weekday": 5,
    "วัน": "16/3",
    "เช้า": 4.6,
    "เย็น": 6.3,
    "รวม": 5.45
  },
  {
    "วันที่": "17/3/2564",
    "unix": 242599,
    "weekday": 6,
    "วัน": "17/3",
    "เช้า": 4.4,
    "เย็น": 5.5,
    "รวม": 4.95
  }
]
